Revit 2027 API
IFCRange(IFCRange) Constructor
 Instantiates an IFCRange object by copy.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCRange(
	IFCRange from
)
Public Sub New (
	from As IFCRange
)
public:
IFCRange(
	IFCRange^ from
)
new :
        from : IFCRange -> IFCRange
Parameters
from IFCRange
 The IFCRange object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCRange Class
IFCRange Overload
Autodesk.Revit.DB.IFC Namespace